---
kind: type
id: T:Autodesk.Revit.DB.StdPostedWarning
source: html/6c23c00a-6d84-51f3-05e3-5afefaa9e9a4.htm
---
# Autodesk.Revit.DB.StdPostedWarning

Support for Reviewable Warnings sent from AddOn.

## Syntax (C#)
```csharp
public class StdPostedWarning : IDisposable
```

## Remarks
Used to create and send Reviewable Warning from AddOn.